Revit 2026 API

# GenericGenericSelfIllumLuminance Property

---

The property labeled "Luminance" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericSelfIllumLuminance { get; }
```
```vb
Public Shared ReadOnly Property GenericSelfIllumLuminance As String
	Get
```
```cpp
public:
static property String^ GenericSelfIllumLuminance {
	String^ get ();
}
```
```fsharp
static member GenericSelfIllumLuminance : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace